loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 50
      name: Warm Up
scenarios:
  - name: "get meta info for a product"
    flow:
      - get:
          url: "/reviews/meta/?product_id={{$randomNumber(1,1000000)}}"
      - think: 5
      - get:
          url: "/reviews/?product_id={{$randomNumber(1,1000000)}}"